%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库

%% 引入潜伏者和死亡者的SERID模型
[t,y] = ode45('odefun_Covid_19_SERID',[0,500],[0.99 0.005 0.005 0 0]);%S=0.99 I=0.005 E = 0.005 R=0  D=0
plot(t,y(:,1),'-g',t,y(:,2),'-r',t, y(:,3),'-b', t, y(:,4),'-', t, y(:,5),'-')
legend('易感染人S', '患者I', '潜伏者E', '移除者R', '死亡者D');
title('新冠SERID模型-SERID五类人所占比例随时间变化图')
xlabel('时间');   
ylabel('比例');
grid on;

%% 修正潜伏者传染率和转阴率
[t,y] = ode45('odefun_Covid_19_SERID_1',[0,150],[0.99 0.005 0.005 0 0]);%S=0.99 I=0.005 E = 0.005 R=0  D=0
plot(t,y(:,1),'-g',t,y(:,2),'-r',t, y(:,3),'-b', t, y(:,4),'-', t, y(:,5),'-')
legend('易感染人S', '患者I', '潜伏者E', '移除者R', '死亡者D');
title('新冠SE_1RID模型-SERID五类人所占比例随时间变化图')
xlabel('时间');   
ylabel('比例');
grid on;

%% 引入隔离者的SERIDQ模型
[t,y] = ode45('odefun_Covid_19_SERIDQ',[0,150],[0.99 0.005 0.005 0 0 0]);%S=0.99 I=0.005 E = 0.005 R=0  D=0  Q=0
plot(t,y(:,1),'-g',t,y(:,2),'-r',t, y(:,3),'-b', t, y(:,4),'-', t, y(:,5),'-', t, y(:,6),'-')
legend('易感染人S', '患者I', '潜伏者E', '移除者R', '死亡者D', '隔离者Q');
title('新冠SERIDQ模型-SERIDQ六类人所占比例随时间变化图')
xlabel('时间');   
ylabel('比例');
grid on;

%% 引入自我隔离者的SERIDQF模型
[t,y] = ode45('odefun_Covid_19_SERIDQ',[0,30],[0.99 0.005 0.005 0 0 0]);%S=0.99 I=0.005 E = 0.005 R=0  D=0  Q=0
plot(t, y(:,1), '-g', t,y(:,2),'-r',t, y(:,3),'-b', t, y(:,4),'-c', t, y(:,5),'-m', t, y(:,6),'-y')
hold on;

% 30天后政府开始干预
n = size(y,1);
[t1,y1] = ode45('odefun_Covid_19_SERIDQF',[30,150],[y(n,1), y(n,2), y(n,3), y(n,4), y(n,5), y(n,6)]);
plot(t1, y1(:,1), '-g',t1,y1(:,2),'-r',t1, y1(:,3),'-b', t1, y1(:,4),'-c', t1, y1(:,5),'-m', t1, y1(:,6),'-y')
legend('易感染人S', '患者I', '潜伏者E', '移除者R', '死亡者D', '隔离者Q');
title('新冠SERIDQF模型-政府在30天干预后SERIDQ六类人所占比例随时间变化图')
xlabel('时间');   
ylabel('比例');
grid on;

%% 注意：代码文件仅供参考，一定不要直接用于自己的数模论文中
%% 国赛对于论文的查重要求非常严格，代码雷同也算作抄袭
%% 全套课程购买地址：https://k.youshop10.com/NjNu80mX
%% 全套教材PPT请关注微信公众号：大师兄的知识库